app/controllers/forgot_passwords_controller.rb

  def create
    user = User.where(email: params[:email]).first
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'wk@example.com' ORDER BY "users"."id" ASC LIMIT 1