app/controllers/invitations_controller.rb

  def create
  	@invitation = Invitation.create(invitation_params.merge!(inviter_id: current_user.id))
---
INSERT INTO "invitations" ("created_at", "inviter_id", "message", "recipiant_email", "recipiant_name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)