app/controllers/relationships_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
INSERT INTO "relationships" ("created_at", "follower_id", "leader_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Fri, 02 May 2014 10:11:10 UTC +00:00], ["follower_id", 1], ["leader_id", 2], ["updated_at", Fri, 02 May 2014 10:11:10 UTC +00:00]]
---
  def create
  	leader = User.find(params[:leader_id])
	relationship = Relationship.create(leader_id: params[:leader_id], follower_id: current_user.id) unless current_user.follows?(leader) || current_user.id == leader.id

SELECT "relationships".* FROM "relationships" WHERE "relationships"."id" = ? LIMIT 1  [["id", "2"]]
DELETE FROM "relationships" WHERE "relationships"."id" = ?  [["id", 2]]
---
  def destroy
  	relationship = Relationship.find(params[:id])
  	relationship.destroy if relationship.follower == current_user