app/controllers/reset_passwords_controller.rb

  def show
  	user = User.where(token: params[:id]).first
---
SELECT "users".* FROM "users" WHERE "users"."token" = '8Qbiy-VTHooRe7wLApgTZQ' ORDER BY "users"."id" ASC LIMIT 1

  def create
  	user = User.where(token: params[:token]).first
  	if user
  	  user.password = params[:password]
  	  user.generate_token
	    user.save
---
SELECT "users".* FROM "users" WHERE "users"."token" = '8Qbiy-VTHooRe7wLApgTZQ' ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "password_digest" = ?, "token" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password_digest", "$2a$10$NW6mgA4hDoHT2LDPA2h/Qui6Rn9B0svbXDG7FRYwa3YnUt6cqWPdi"], ["token", "XnnxF6jdg1auRvdlreTfKQ"], ["updated_at", Sat, 10 May 2014 15:00:42 UTC +00:00]]