app/controllers/reviews_controller.rb

SELECT "videos".* FROM "videos" WHERE "videos"."id" = ? LIMIT 1  [["id", "3"]]
INSERT INTO "reviews" ("content", "created_at", "rating", "updated_at", "user_id", "video_id") VALUES (?, ?, ?, ?, ?, ?)  [["content", "wiejowiejrowiejr"], ["created_at", Fri, 04 Apr 2014 05:10:00 UTC +00:00], ["rating", 3], ["updated_at", Fri, 04 Apr 2014 05:10:00 UTC +00:00], ["user_id", 1], ["video_id", 3]]
---
  def create
 	@video = Video.find(params[:video_id])
 	review = @video.reviews.create(review_params.merge!(user: current_user))