app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("created_at", "email", "fullname", "password_digest", "token", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def new_with_invitation_token
    invitation = Invitation.where(token: params[:token]).first
---
SELECT "invitations".* FROM "invitations" WHERE "invitations"."token" IS NULL ORDER BY "invitations"."id" ASC LIMIT 1