app/controllers/videos_controller.rb

  def index
    @videos = Video.all
    @category = Category.all
---
SELECT "categories".* FROM "categories"

  def show
    @video = Video.find_by id: params[:id]
---
SELECT "videos".* FROM "videos" WHERE "videos"."id" = 1 LIMIT 1

  def find_user
    @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]